In [1]:
# List of high schools 

high_schools = ["Hernandez High School", "Figueroa High School", "Wilson High School", "Wright High School"]

for schools in high_schools:
    print(schools)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [7]:
# A dictionary of high schools and the type of schools

high_school_types = [{"High School": "Griffin", "Type": "District"},
                     {"High School": "Figueroa", "Type": "District"},
                     {"High School": "Wilson", "Type": "Charter"},
                     {"High School": "Wright", "Type": "Charter"}]

for high_sch in high_school_types:
    
    print(high_sch)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [8]:
# list of high schools

high_schools = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School", "Griffin High School", "Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School", "Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [9]:
# add the pandas dependency
import pandas as pd

In [10]:
# create pandas from a list
school_series = pd.Series(high_schools)

school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffen High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [12]:
# iterate through the series

for schools in school_series:
    print(schools)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffen High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [13]:
# a dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name": "Selton High School", "type": "Charter"},
                    {"School ID": 3, "school_name": "Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name": "Griffin High School", "type": "Charter"}]

In [14]:
# pandas dataframe from a dictionary

school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2     Selton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [19]:
 # three seperate lists of information on high schools
    
school_ID = [0, 1, 2, 3, 4]
   
school_name = ["Huang High School", "Figueroa High School", "Selton High School", "Hernandez High School", "Griffin High School"]
    
type_of_school = ["District", "District", "Charter", "District", "Charter"]

In [16]:
# Initialize a new Dataframe
schools_df = pd.DataFrame()

In [20]:
# add the list to the new dataframe
schools_df["School ID"] = school_ID

#print the dataframe

schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [26]:
# add the other list to the dataframe

schools_df["School Name"] = school_name

schools_df

   School ID            School Name                      1
0          0      Huang High School      Huang High School
1          1   Figueroa High School   Figueroa High School
2          2     Selton High School     Selton High School
3          3  Hernandez High School  Hernandez High School
4          4    Griffin High School    Griffin High School

In [27]:
schools_df["type"] = type_of_school

schools_df

   School ID            School Name                      1      type
0          0      Huang High School      Huang High School  District
1          1   Figueroa High School   Figueroa High School  District
2          2     Selton High School     Selton High School   Charter
3          3  Hernandez High School  Hernandez High School  District
4          4    Griffin High School    Griffin High School   Charter

In [29]:
# another way to create a Dataframe is to create a python dictionary then covert to a dataframe

high_schools_dict = {"School ID": school_ID, "School Name": school_name, "type": type_of_school}

high_schools_dict

{'School ID': [0, 1, 2, 3, 4],
 'School Name': ['Huang High School',
  'Figueroa High School',
  'Selton High School',
  'Hernandez High School',
  'Griffin High School'],
 'type': ['District', 'District', 'Charter', 'District', 'Charter']}

In [30]:
# converting the python dictionary to a dataframe

high_schools_df = pd.DataFrame(high_schools_dict)

high_schools_df

   School ID            School Name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2     Selton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [36]:
schools_df.remove['1']

schools_df

AttributeError: 'DataFrame' object has no attribute 'remove'